# Table of Contents

1. Importing libraries and data
2. Data Wrangling
3. Data Consistency Checks
4. Combining customer data with the rest of prepared Instacart data

# 1. Importing libraries and data

In [2]:
#Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
#Set the path
path = r'C:\Users\midov\Documents\Studies\Data Analysis\Immersion into Data Analytics\Achievement 4_Python Fundamentals for Data Analysts\Instacart Basket Analysis'

In [4]:
#Import the “customers.csv” file as df_customers, using path variable
df_customers = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
df_customers.shape

(206209, 10)

In [6]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 2. Data Wrangling

In [7]:
# Rename the columns with illogical names
df_customers.rename(columns= {'First Name':'first_name', 'Surnam': 'surname', 'Gender':'gender', 'STATE':'state',
                          'Age':'age', 'n_dependants':'no_of_dependants', 'fam_status':'marital_status'}, inplace = True)

In [8]:
df_customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,no_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 3. Data Consistency Checks

In [9]:
#Check for missing values
df_customers.isnull().sum()

user_id                 0
first_name          11259
surname                 0
gender                  0
state                   0
age                     0
date_joined             0
no_of_dependants        0
marital_status          0
income                  0
dtype: int64

In [10]:
#View missing values
df_nan = df_customers[df_customers['first_name'].isnull() == True]

In [11]:
df_nan

,user_id,first_name,surname,gender,state,age,date_joined,no_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

Missing values for first_name column don't have an impact on the analysis, as there is user_id as key idintifier of a customer.

In [12]:
#Check for mixed-type values
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

first_name is problematic column

In [13]:
#Convert first_name data type to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [14]:
#Check the data types
df_customers.dtypes

user_id              int64
first_name          object
surname             object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
marital_status      object
income               int64
dtype: object

In [15]:
#Re-check for mixed-type values
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [16]:
#Check for duplicates
df_customers[df_customers.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, no_of_dependants, marital_status, income]
Index: []

No duplicates

# 4. Combining customer data with the rest of prepared Instacart data

In [17]:
#Import the prepared data
df_ords_prds_merged = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_user_flags.pkl'))

In [18]:
#Check the shape
df_ords_prds_merged.shape

(32404859, 21)

In [19]:
#Check the name of the columns to see the common name
df_ords_prds_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,...,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,avg_price,spender_flag,median_order_duration,Frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Soda,77,7,9.0,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

user_id is a common column

In [20]:
#Check for data type of user_id
df_ords_prds_merged['user_id'].dtype

dtype('int64')

The key columns (user_id) are of the same data type (int64)

In [21]:
#Merge the df "customers" with df ords_prds_merged
df_merged = df_ords_prds_merged.merge(df_customers, on = 'user_id')

In [22]:
#Export new merged file as pkl
df_merged.to_pickle(os.path.join(path, 'Data','Prepared Data', 'df_merged_final.pkl'))